Revit 2027 API
BuiltInFailures.LoadFailures.LineLoadAllZero Property
 Line Load can't have all force components and moment components to be zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LineLoadAllZero { get; }
Public Shared ReadOnly Property LineLoadAllZero As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LineLoadAllZero {
	FailureDefinitionId^ get ();
}
static member LineLoadAllZero : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace